app/views/drinks/new.html.erb

        category_options = []
        Category.all.each do |category|
---
SELECT "categories".* FROM "categories"