app/controllers/drinks_controller.rb

  def create
    @drink = Drink.new(drink_params)
    if @drink.save
---
INSERT INTO "drinks" ("title", "description", "category_id", "alcohol_level", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "test LEVEL"], ["description", "test"], ["category_id", 1], ["alcohol_level", "Medium"], ["created_at", "2015-06-21 22:46:48.985161"], ["updated_at", "2015-06-21 22:46:48.985161"]]

  def index
    if params[:category_id] == nil
      @drinks = Drink.all.page(params[:page])
    else
      @category = Category.find(params[:category_id])
      @drinks = @category.drinks.page(params[:page])
---
SELECT  "drinks".* FROM "drinks" LIMIT 25 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "drinks" LIMIT 25 OFFSET 0) subquery_for_count
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "drinks".* FROM "drinks" WHERE "drinks"."category_id" = $1 LIMIT 25 OFFSET 0  [["category_id", 4]]
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "drinks" WHERE "drinks"."category_id" = $1 LIMIT 25 OFFSET 0) subquery_for_count  [["category_id", 4]]

  def destroy
    Drink.find_by(id: params[:id]).destroy
---
DELETE FROM "drinks" WHERE "drinks"."id" = $1  [["id", 17]]
SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = $1 LIMIT 1  [["id", 0]]